Practica_en_PHP/app/Controllers/UserController.php

SELECT *
FROM `libros`
ORDER BY `id` ASC
---
    public function index()
    {
        $libro = new BookModel();
        $datos['libros']= $libro->orderBy('id','ASC')->findAll();

SELECT *
FROM `autores`
ORDER BY `id` ASC
---
    public function ListAuthor(){
        $author = new AuthorModel();
        $datos['autores'] = $author->orderBy('id','ASC')->findAll();

SELECT *
FROM `libros`
WHERE `id` = '7'
 LIMIT 1
---
    public function editar($id=null){
        //print_r($id);
        $libro = new BookModel();
        $datos['libro']=$libro->where('id',$id)->first();